# MappedServiceId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartSizeMap..::..MappedServiceId Property
FabricationPartSizeMap Class See Also
---
The mapped service identifier of the straight.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public int MappedServiceId { get; set; }
```

Visual Basic
---
```text
Public Property MappedServiceId As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int MappedServiceId {
	int get ();
	void set (int value);
}
```

# See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace